##Importing Libraries

In [2]:
import pandas as pd
import numpy as np

##Loading dataset

In [3]:
df=pd.read_csv('Messy_Employee_dataset.csv')

##Exploraing data

In [4]:
df.head(5)

,Employee_ID,First_Name,Last_Name,Age,Department_Region,Status,Join_Date,Salary,Email,Phone,Performance_Score,Remote_Work
0,EMP1000,Bob,Davis,25.0,DevOps-California,Active,4/2/2021,59767.65,bob.davis@example.com,-1651623197,Average,True
1,EMP1001,Bob,Brown,NaN,Finance-Texas,Active,7/10/2020,65304.66,bob.brown@example.com,-1898471390,Excellent,True
2,EMP1002,Alice,Jones,NaN,Admin-Nevada,Pending,12/7/2023,88145.90,alice.jones@example.com,-5596363211,Good,True
3,EMP1003,Eva,Davis,25.0,Admin-Nevada,Inactive,11/27/2021,69450.99,eva.davis@example.com,-3476490784,Good,True
4,EMP1004,Frank,Williams,25.0,Cloud Tech-Florida,Active,1/5/2022,109324.61,frank.williams@example.com,-1586734256,Poor,False

In [5]:
df.tail(5)

,Employee_ID,First_Name,Last_Name,Age,Department_Region,Status,Join_Date,Salary,Email,Phone,Performance_Score,Remote_Work
1015,EMP2015,David,Miller,30.0,HR-California,Active,8/19/2023,NaN,david.miller@example.com,-3546212759,Good,True
1016,EMP2016,David,Johnson,30.0,Cloud Tech-Texas,Inactive,11/7/2021,100215.06,david.johnson@example.com,-2508261122,Good,True
1017,EMP2017,Charlie,Williams,40.0,Finance-New York,Active,10/4/2023,114587.11,charlie.williams@example.com,-1261632487,Average,False
1018,EMP2018,Alice,Garcia,30.0,HR-Florida,Inactive,12/16/2024,71318.79,alice.garcia@example.com,-8995729892,Good,True
1019,EMP2019,Heidi,Jones,30.0,DevOps-Illinois,Pending,2/22/2021,77764.24,heidi.jones@example.com,-7629745492,Average,False

In [6]:
df.shape

(1020, 12)

In [7]:
df.describe(include='object')

,Employee_ID,First_Name,Last_Name,Department_Region,Status,Join_Date,Email,Performance_Score
count,1020,1020,1020,1020,1020,1020,1020,1020
unique,1020,8,8,36,3,760,64,4
top,EMP1000,Frank,Brown,HR-Florida,Pending,6/10/2024,grace.brown@example.com,Good
freq,1,142,148,41,356,5,27,270

In [8]:
df.describe()

              Age         Salary         Phone
count  809.000000     996.000000  1.020000e+03
mean    32.484549   85155.056396 -4.942253e+09
std      5.656860   19873.727918  2.817326e+09
min     25.000000   50047.320000 -9.994973e+09
25%     25.000000   68392.487500 -7.341992e+09
50%     30.000000   85547.870000 -4.943997e+09
75%     40.000000  100974.027500 -2.520391e+09
max     40.000000  119971.650000 -3.896086e+06

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1020 entries, 0 to 1019
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Employee_ID        1020 non-null   object
 1   First_Name         1020 non-null   object
 2   Last_Name          1020 non-null   object
 3   Age                809 non-null    float64
 4   Department_Region  1020 non-null   object
 5   Status             1020 non-null   object
 6   Join_Date          1020 non-null   object
 7   Salary             996 non-null    float64
 8   Email              1020 non-null   object
 9   Phone              1020 non-null   int64
 10  Performance_Score  1020 non-null   object
 11  Remote_Work        1020 non-null   bool
dtypes: bool(1), float64(2), int64(1), object(8)
memory usage: 88.8+ KB

##Data cleaning

Changing datatypes

In [ ]:
df['Join_Date']=df['Join_Date'].astype('datetime64[ns]')

Null values

In [ ]:
df.isnull().sum()

Employee_ID          0
First_Name           0
Last_Name            0
Age                  0
Department_Region    0
Status               0
Join_Date            0
Salary               0
Email                0
Phone                0
Performance_Score    0
Remote_Work          0
dtype: int64

Filling missing values

In [ ]:
df['Age']=df['Age'].fillna(df['Age'].mean())

In [ ]:
df['Salary']=df['Salary'].fillna(df['Salary'].mean())

Checking duplicates

In [ ]:
df.duplicated().sum()

np.int64(0)

Removing '-' sign from Phone column

In [ ]:
df['Phone']=df['Phone'].astype(str)

In [ ]:
df['Phone']=df['Phone'].str.replace('-',"",regex=True)

In [ ]:
df['Phone']=df['Phone'].astype(int)

Making new column from Department-Region

In [ ]:
df['Department'] = df['Department_Region'].str.split('-').str[0]
df['Region'] = df['Department_Region'].str.split('-').str[1]

droping old column

In [ ]:
df.drop(columns='Department_Region', inplace=True)

In [ ]:
df

,Employee_ID,First_Name,Last_Name,Age,Status,Join_Date,Salary,Email,Phone,Performance_Score,Remote_Work,Department,Region
0,EMP1000,Bob,Davis,25.0,Active,4/2/2021,59767.65,bob.davis@example.com,-1651623197,Average,True,DevOps,California
1,EMP1001,Bob,Brown,NaN,Active,7/10/2020,65304.66,bob.brown@example.com,-1898471390,Excellent,True,Finance,Texas
2,EMP1002,Alice,Jones,NaN,Pending,12/7/2023,88145.90,alice.jones@example.com,-5596363211,Good,True,Admin,Nevada
3,EMP1003,Eva,Davis,25.0,Inactive,11/27/2021,69450.99,eva.davis@example.com,-3476490784,Good,True,Admin,Nevada
4,EMP1004,Frank,Williams,25.0,Active,1/5/2022,109324.61,frank.williams@example.com,-1586734256,Poor,False,Cloud Tech,Florida
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1015,EMP2015,David,Miller,30.0,Active,8/19/2023,NaN,david.miller@example.com,-3546212759,Good,True,HR,California
1016,EMP2016,David,Johnson,30.0,Inactive,11/7/2021,100215.06,david.johnson@example.com,-2508261122,Good,True,Cloud Tech,Texas
1017,EMP2017,Charlie,Williams,40.0,Active,10/4/2023,114587.11,charlie.williams@example.com,-1261632487,Average,False,Finance,New York
1018,EMP2018,Alice,Garcia,30.0,Inactive,12/16/2024,71318.79,alice.garcia@example.com,-8995729892,Good,True,HR,Florida
1019,EMP2019,Heidi,Jones,30.0,Pending,2/22/2021,77764.24,heidi.jones@example.com,-7629745492,Average,False,DevOps,Illinois